## Hendrik Venter - Reading Data

In [20]:
import numpy as np
import pandas as pd

### Read in the datafile `./Data/MainBelt.csv`

In [21]:
belt_table = pd.read_csv('./Data/MainBelt.csv', comment = "#", header= None)

In [22]:
belt_table.rename(columns={0: 'Asteroid Name'}, inplace=True)
belt_table.rename(columns={1: 'Absolute Magnitude'}, inplace=True)
belt_table.rename(columns={2: 'Geometric Albedo'}, inplace=True)

In [23]:
belt_table

           Asteroid Name  Absolute Magnitude  Geometric Albedo
0                1 Ceres                3.34            0.0900
1               2 Pallas                4.13            0.1587
2                 3 Juno                5.33            0.2383
3                4 Vesta                3.20            0.4228
4              5 Astraea                6.85            0.2268
...                  ...                 ...               ...
2021     26125 (1992 RG)               13.00            0.0975
2022    26171 (1996 BY2)               14.00            0.0480
2023    26260 (1998 RA2)               13.30            0.0670
2024   26604 (2000 FO25)               12.80            0.4331
2025  26662 (2000 WB181)               14.50            0.0186

[2026 rows x 3 columns]

### Write a function called `find_diameter` to compute the Diameters of the Main Belt Asteroids (MBAs)

* The function takes 2 arguments: an absolute magnitude and an geometric albedo
* The function returns the diameter of the asteroid (in km)
* The largest asteroid should have a diameter of ~ 1000 km

In [24]:
def find_diameter(absolute_magnitude,geometric_albedo):
    compute_diameter = (1329)/(np.sqrt(geometric_albedo))*10**((-0.2)*(absolute_magnitude))
    return compute_diameter

In [25]:
diameter = find_diameter(belt_table['Absolute Magnitude'],belt_table['Geometric Albedo'])
diameter

0       951.488900
1       498.008227
2       233.863777
3       468.228119
4       119.042888
           ...
2021     10.691107
2022      9.614005
2023     11.232788
2024      5.561999
2025     12.267851
Length: 2026, dtype: float64

### Add a `Diameter` column to the data table

In [26]:
belt_table.insert(3,'Diameter (km)', diameter, allow_duplicates = False)

In [27]:
belt_table

           Asteroid Name  Absolute Magnitude  Geometric Albedo  Diameter (km)
0                1 Ceres                3.34            0.0900     951.488900
1               2 Pallas                4.13            0.1587     498.008227
2                 3 Juno                5.33            0.2383     233.863777
3                4 Vesta                3.20            0.4228     468.228119
4              5 Astraea                6.85            0.2268     119.042888
...                  ...                 ...               ...            ...
2021     26125 (1992 RG)               13.00            0.0975      10.691107
2022    26171 (1996 BY2)               14.00            0.0480       9.614005
2023    26260 (1998 RA2)               13.30            0.0670      11.232788
2024   26604 (2000 FO25)               12.80            0.4331       5.561999
2025  26662 (2000 WB181)               14.50            0.0186      12.267851

[2026 rows x 4 columns]

### Write a function called `find_mass` to compute the Masses of the MBAs. Assume $\rho$ = 3,000 kg/m$^3$

* The function takes 2 arguments: a diameter and a density `(diameter, density)`
* The function returns the mass of the asteroid
* Watch your units!
* The most massive asteroid should have a mass of ~ 1e21 kg

In [28]:
def find_mass(diameter,density):
    compute_mass = ((density)*(np.pi)*(diameter*1000)**3)/6
    return(compute_mass)

In [29]:
density = 3000
mass = find_mass(belt_table['Diameter (km)'],density)
print('Mass of most massive asteroid:', mass.max(), 'kg')

Mass of most massive asteroid: 1.35310361929439e+21 kg

### Add a `Mass` column to the data table

In [30]:
belt_table.insert(4,'Mass (kg)', mass, allow_duplicates = False)

In [31]:
belt_table

,Asteroid Name,Absolute Magnitude,Geometric Albedo,Diameter (km),Mass (kg)
0,1 Ceres,3.34,0.0900,951.488900,1.353104e+21
1,2 Pallas,4.13,0.1587,498.008227,1.940124e+20
2,3 Juno,5.33,0.2383,233.863777,2.009133e+19
3,4 Vesta,3.20,0.4228,468.228119,1.612473e+20
4,5 Astraea,6.85,0.2268,119.042888,2.649905e+18
...,...,...,...,...,...
2021,26125 (1992 RG),13.00,0.0975,10.691107,1.919499e+15
2022,26171 (1996 BY2),14.00,0.0480,9.614005,1.395831e+15
2023,26260 (1998 RA2),13.30,0.0670,11.232788,2.226295e+15
2024,26604 (2000 FO25),12.80,0.4331,5.561999,2.702791e+14
2025,26662 (2000 WB181),14.50,0.0186,12.267851,2.900183e+15

## Answer the following question using DataFrame [Methods and Attributes](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

### List the 5 most massive MBAs

In [32]:
five_most_massive_MBA = belt_table.nlargest(5,"Mass (kg)")
five_most_massive_MBA

,Asteroid Name,Absolute Magnitude,Geometric Albedo,Diameter (km),Mass (kg)
0,1 Ceres,3.34,0.0900,951.488900,1.353104e+21
1,2 Pallas,4.13,0.1587,498.008227,1.940124e+20
3,4 Vesta,3.20,0.4228,468.228119,1.612473e+20
9,10 Hygiea,5.43,0.0717,407.160279,1.060269e+20
445,511 Davida (1903 LU),6.22,0.0540,326.082957,5.446333e+19

### List the 5 least massive MBAs

In [33]:
five_least_massive_MBA = belt_table.nsmallest(5,"Mass (kg)")
five_least_massive_MBA

,Asteroid Name,Absolute Magnitude,Geometric Albedo,Diameter (km),Mass (kg)
2024,26604 (2000 FO25),12.8,0.4331,5.561999,2.702791e+14
1630,4335 Verona (1983 VC7),13.3,0.2418,5.912850,3.247210e+14
1492,3338 Richter (1973 UX5),14.2,0.1000,6.074702,3.521233e+14
1597,4121 Carlin (1986 JH),12.6,0.4164,6.219703,3.779451e+14
1774,6295 Schmoll (1988 CF3),14.0,0.1114,6.310770,3.947908e+14

### Determine the total mass of all of the MBAs

In [34]:
total_mass_MBA = belt_table["Mass (kg)"].sum()
print('Total mass of MBAs:',total_mass_MBA, 'kg')

Total mass of MBAs: 3.146177625451557e+21 kg

### Determine the fraction of the total mass contained in the 5 largest MBAs

In [73]:
frac_total_mass_five_largest_MBA = five_most_massive_MBA["Mass (kg)"].sum()/total_mass_MBA*100

In [74]:
print('Fraction of the total mass of the five largest main belt asteroids:', frac_total_mass_five_largest_MBA)

Fraction of the total mass of the five largest main belt asteroids: 59.40076222297952

### How does the total mass of the MBAs compare to the mass of the Moon ($7.35\ \times\ 10^{22}$ kg)?

* Compute Total MBA Mass / Lunar Mass

In [37]:
mass_of_luna = 7.35e22
mass_comparison = total_mass_MBA/mass_of_luna
mass_comparison

0.04280513776124567

In [75]:
mass_comparison_reverse = mass_of_luna/total_mass_MBA
mass_comparison_reverse

23.36168161816702

In [38]:
percentage = mass_comparison * 100
print(percentage, "%")

4.280513776124567 %

### Due Mon Jan 27  - 1pm
- `Make sure to change the filename to your name!`
- `Make sure to change the Title to your name!`
- `Save notebook as .html: File -> Download as -> HTML (.html)`
- `Upload .html to Canvas`

***

## Absolute Magnitude, Size and Mass - Solar System Objects

The **absolute magnitude** of a solar system object is the magnitude that it would have if it was 1 AU from the Earth and 1 AU from the Sun while having a phase angle of 0 degrees. Remember, astronomical magnitudes are "backwards".  The magnitude of a bright object is *less* than the magnitude of a dimmer object.

The phase angle **$\theta$** in astronomical observations is the angle between the light incident onto an observed object and the light reflected from the object. In the context of astronomical observations, this is usually the angle $\angle$ Sun-object-observer.

<p align="center"> 
<img src="./images/Phase.jpg">
</p>

It is actually impossible for an object to be 1 AU from the Earth and 1 AU from the Sun while having a phase angle of 0 degrees. The Sun and the Earth would occupy the same point.  However, this is the definition of **absolute magnitude**.  Please note, that the definition of absolute magnitude for solar system objects is *very* different from the definition of absolute magnitude used for stars.

The Absolute magnitude of an object is related to the physical size of the object via the equation:

$$\large \textrm{Diameter}\ (\textrm{in km}) = \frac{1329}{\sqrt{\textrm{geometric albedo}}}\  10^{-0.2(\textrm{absolute magnitude})}$$

The **geometric albedo** of an astronomical body is the ratio of its actual brightness at zero phase angle (i.e., as seen from the light source) to that of an idealized flat, fully reflecting, diffusively scattering disk with the same cross-section.

Perfect reflectors of light have a **geometric albedo** = 1 and perfect absorbers have a **geometric albedo** = 0. 
Typical asteroids have a wide range of values: 0.02 $<$ **geometric albedo** $<$ 0.8.

----

Once we have the diameter of the object, we can determine the mass if we know the density ($\rho$).

$ \large \mathrm{Mass} = \rho \cdot \mathrm{Volume} = \rho \cdot \frac{4}{3} \pi r^3 \ = \ \rho \cdot \frac{1}{6} \pi D^3 $

This assumes that the object is spherical (this is **not** a very good assumption for asteroids).

In [56]:
five_most_massive_MBA
five_most_massive_MBA.reset_index(inplace = True)

In [69]:
for index, row in five_most_massive_MBA.iterrows():
    my_out_string = (f"At number {index+1} is {row['Asteroid Name']} with a mass of {row['Mass (kg)']:.2e} kg")
    print(my_out_string)

At number 1 is 1 Ceres with a mass of 1.35e+21 kg
At number 2 is 2 Pallas with a mass of 1.94e+20 kg
At number 3 is 4 Vesta with a mass of 1.61e+20 kg
At number 4 is 10 Hygiea with a mass of 1.06e+20 kg
At number 5 is 511 Davida (1903 LU) with a mass of 5.45e+19 kg

In [70]:
five_least_massive_MBA
five_least_massive_MBA.reset_index(inplace = True)

In [71]:
for index, row in five_least_massive_MBA.iterrows():
    my_out_string = (f"At number {index+1} is {row['Asteroid Name']} with a mass of {row['Mass (kg)']:.2e} kg")
    print(my_out_string)

At number 1 is 26604 (2000 FO25) with a mass of 2.70e+14 kg
At number 2 is 4335 Verona (1983 VC7) with a mass of 3.25e+14 kg
At number 3 is 3338 Richter (1973 UX5) with a mass of 3.52e+14 kg
At number 4 is 4121 Carlin (1986 JH) with a mass of 3.78e+14 kg
At number 5 is 6295 Schmoll (1988 CF3) with a mass of 3.95e+14 kg

In [72]:
total_mass_MBA

3.146177625451557e+21

In [88]:
paragraph = (f'The total mass of the main belt of the asteroid belt is {total_mass_MBA:.2e} kg, of which {frac_total_mass_five_largest_MBA:.2f} of the total mass in contained in the five most massive asteroids. The Moon is {mass_comparison_reverse:.2f} times more massive than the total mass of the main belt asteroids')

In [89]:
paragraph

'The total mass of the main belt of the asteroid belt is 3.15e+21 kg, of which 59.40 of the total mass in contained in the five most massive asteroids. The Moon is 23.36 times more massive than the total mass of the main belt asteroids'